//=============================================================================
//
// チュートリアルの処理 [tutroial.h]
// Author : 伊藤陽梧
//
//=============================================================================
#ifndef _TUTRIAL_H_
#define _TUTRIAL_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"
#include "scene.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CScene2D;
class CSound;

//=============================================================================
// チュートリアルクラス
//=============================================================================
class CTutorial
{
public:
	CTutorial();  // コンストラク
	~CTutorial(); // デストラクタ

	static CTutorial *Create(); // クリエイト

	HRESULT Init();    // 初期化処理
	void Uninit(void); // 終了処理
	void Update(void); // 更新処理
	void Draw(void);   // 描画処理
private:
	static LPDIRECT3DTEXTURE9 m_pTexture; // textureのポインタ
	bool	 m_bTrriger; //	押したときの判定
};
#endif