//=============================================================================
//
// フェードの処理 [fade.cpp]
// Author :　伊藤陽梧
//
//=============================================================================
#include "fade.h"
#include "scene2d.h"
#include "manager.h"
#include "renderer.h"

//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
CFade::FADE CFade::m_fade = FADE_NONE;
CManager::MODE CFade::m_mode = CManager::MODE_NONE;

//=============================================================================
// コンストラクタ
//=============================================================================
CFade::CFade(int nPriority) :CScene2D(nPriority)
{
	m_pVtxBuff = NULL;
	m_pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_color = D3DXCOLOR(0.0f, 0.0f, 0.0f, 0.0f);
	m_TexPos = 0;
	m_color = D3DXCOLOR(0.0f, 0.0f, 0.0f, 0.0f);
	m_PolygonWidth = 0;
	m_PolygonHeight = 0;
}

//=============================================================================
// デストラクタ
//=============================================================================
CFade::~CFade()
{
}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CFade::Init(void)
{
	SetPosition(D3DXVECTOR3((SCREEN_WIDTH / 2), (SCREEN_HEIGHT / 2), 0.0f));
	CScene2D::Init();
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CFade::Uninit(void)
{
	CScene2D::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void CFade::Update(void)
{
	if (m_fade != FADE_NONE)
	{
		if (m_fade == FADE_IN)
		{
			FadeIn();
		}
		else if (m_fade == FADE_OUT)
		{
			FadeOut();
		}
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void CFade::Draw(void)
{
	CScene2D::Draw();
}

//=============================================================================
// セット
//=============================================================================
void CFade::SetFade(CManager::MODE mode)
{
	SetPosition(D3DXVECTOR3((SCREEN_WIDTH / 2), (SCREEN_HEIGHT / 2), 0.0f));
	SetSize(D3DXVECTOR3(SCREEN_WIDTH, SCREEN_HEIGHT, 0.0f));
	SetColor(D3DXCOLOR(0.0f, 0.0f, 0.0f, 0.0f));
	SetObjType(CScene::OBJTYPE_FADE);
	m_fade = FADE_IN;
	m_mode = mode;
}

//=============================================================================
// フェードイン処理
//=============================================================================
void CFade::FadeIn(void)
{
	m_color.a += 0.02f;
	if (m_color.a >= 1.0f)
	{
		m_color.a = 1.0f;
		m_fade = FADE_OUT;
		GetManager()->SetMode(m_mode);
		return;
	}
	SetColor(m_color);
	CScene2D::Update();
}

//=============================================================================
// フェードアウト処理
//=============================================================================
void CFade::FadeOut(void)
{	
	m_color.a -= 0.02f;
	if (m_color.a <= 0.0f)
	{
		m_color.a = 0.0f;
		m_fade = FADE_NONE;
		return;
	}
	SetColor(m_color);
	CScene2D::Update();
}