//=============================================================================
//
// ゲーム処理 [game.h]
// Author : 伊藤陽梧
//
//=============================================================================
#ifndef _GAME_H_
#define _GAME_H_

//=============================================================================
// ヘッダファイルのインクルード
//=============================================================================
#include "mode.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CPlayer;

//=============================================================================
// ゲームクラス
//=============================================================================
class CGame :public CMode
{
public:
	CGame();
	~CGame();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CPlayer *GetPlayer(void);
	static void SubtractEnemy(void) { m_nEnemyNum--; }
private:
	static CPlayer *m_pPlayer;	//プレイヤー
	static int m_nEnemyNum;
	bool m_bEnemyCreate;
	int m_nEnemyCreateTime;
};
#endif