//=============================================================================
//
// 火花のエフェクトの処理 [spark.h]
// Author : 伊藤陽梧
//
//=============================================================================
#ifndef _SPARK_H_
#define _SPARK_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include"particle.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define SPARK_COUNTANIM (8)	// テクスチャの横の分割
#define SPARK_PATTERNANIM (1) // テクスチャの縦の分割
#define SPARK_TIMEANIM (2)	// アニメーションの時間

//=============================================================================
// スパーククラス
//=============================================================================
class CSpark : public CParticle
{
public:
	CSpark();
	~CSpark();

	static CSpark *Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, D3DXCOLOR col, int Life);
	HRESULT Init();
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:
};
#endif