//=============================================================================
//
// チュートリアル処理 [tutorial.h]
// Author : 伊藤陽梧
//
//=============================================================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "mode.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CPlayer;

//=============================================================================
// チュートリアルクラス
//=============================================================================
class CTutorial :public CMode
{
public:
	CTutorial();
	~CTutorial();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	static CPlayer *m_pPlayer;	//プレイヤー
	int m_nCount;
	bool m_bSoundGameStart;	//ゲームスタートサウンドが再生されているかの判定
};

#endif