//=============================================================================
//
// ゲーム終了UIの処理 [game_finish.h]
// Author : 佐藤颯紀
//
//=============================================================================
#ifndef _GAME_FINISH_H_
#define _GAME_FINISH_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "scene.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CPolygon;

//=============================================================================
// マクロ定義
//=============================================================================
#define FINISH_POS_Y  (350.0f)	// finish文字のY位置
#define FINISH_SIZE_X (550.0f)	// Xサイズ
#define FINISH_SIZE_Y (150.0f)	// Yサイズ
//=============================================================================
// クラス宣言
//=============================================================================
class CGameFinish :public CScene
{
public:
	CGameFinish();	// コンストラクタ
	~CGameFinish();	// デストラクタ

	static CGameFinish*Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);	// 生成処理

	HRESULT Init(void);					// 初期化処理
	void Uninit(void);					// 終了処理
	void Update(void);					// 更新処理
	void Draw(void);					// 描画処理	

private:
	// メンバ関数

	// メンバ変数
	CPolygon*   m_pPolygon;		// ライフ描画用のポリゴン
	D3DXVECTOR3 m_pos;			// 位置
	D3DXVECTOR3 m_size;			// サイズ
	D3DXCOLOR   m_col;			// カラー
	int			m_nCount;		// カウント

};
#endif // _GAME_FINISH_H_