//=============================================================================
//
// インゲームのテキスト処理 [ingame_text.h]
// Author : 佐藤颯紀
//
//=============================================================================
#ifndef _INGAME_TEXT_H_
#define _INGAME_TEXT_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "scene2d.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CNumber;

//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_DIGIT 2

//=============================================================================
// クラス宣言
//=============================================================================
class CInGameText :public CScene2d
{
public:
	CInGameText();
	~CInGameText();

	static CInGameText*Create(D3DXVECTOR3 pos);	// 生成処理

	HRESULT Init(void);					// 初期化処理
	void Uninit(void);					// 終了処理
	void Update(void);					// 更新処理
	void Draw(void);					// 描画処理	

private:
	// メンバ関数

	// メンバ変数
	D3DXVECTOR3 m_pos;			// 位置
	D3DXVECTOR3 m_size;			// サイズ
	D3DXVECTOR3 m_move;			// 移動量
	D3DXCOLOR   m_col;			// カラー
	int			m_nCount;		// カウント
	CNumber* m_apNumber[MAX_DIGIT]; // ナンバーポリゴン
	int m_nTime;					// タイム変数
};
#endif // !_INGAME_TEXT_H_
