//=============================================================================
//
// 影（ポリゴン）の処理 [shadow.cpp]
// Author : 吉田悠人
//
//=============================================================================

//=============================================================================
// インクルードファイル
//=============================================================================
#include "shadow.h"
#include "resource_texture.h"

//=============================================================================
// コンストラクタ
//=============================================================================
CShadow::CShadow() : CScene3d(OBJTYPE_EFFECT)
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CShadow::~CShadow()
{
}

//=============================================================================
// 生成処理
//=============================================================================
CShadow * CShadow::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	CShadow* pShadow = NULL;
	pShadow = new CShadow;

	if (pShadow != NULL)
	{
		pShadow->Init();					//初期化処理
		pShadow->SetPos(pos);				//位置設定
		pShadow->SetSize(size);				//サイズ設定
		pShadow->SetAngle(0.0f);			//向き設定
		pShadow->SetColor(D3DXCOLOR(0.2f, 0.2f, 0.2f, 0.3f));	//カラー設定
		pShadow->BindTexture(CResourceTexture::GetTexture(CResourceTexture::TEXTURE_SHADOW));	//テクスチャ設定

	}
	return pShadow;
}