////////////////////////////////////////////////////
//
//    タイルエフェクトクラスの処理[tile_effect.cpp]
//    Author:増澤 未来
//
////////////////////////////////////////////////////

//******************************
// インクルード
//******************************
#include "tile_effect.h"

//******************************
// マクロ定義
//******************************
#define ALPHA_RATE 0.1f

//******************************
// コンストラクタ
//******************************
CTileEffect::CTileEffect() :CScene(OBJTYPE_EFFECT)
{
	m_bDraw = false;
}

//******************************
// デストラクタ
//******************************
CTileEffect::~CTileEffect()
{
}

//******************************
// 初期化処理
//******************************
HRESULT CTileEffect::Init(void)
{
	m_fAlpha = 0.0f;

	return S_OK;
}

//******************************
// 終了処理
//******************************
void CTileEffect::Uninit(void)
{
	Release();
}

//******************************
// 更新処理
//******************************
void CTileEffect::Update(void)
{
	if (m_bDraw)
	{
		m_fAlpha += (1.0f - m_fAlpha)*ALPHA_RATE;
	}
	else
	{
		m_fAlpha += (0.0f - m_fAlpha)*ALPHA_RATE;
	}
}