//=============================================================================
//
// ワープ床ヘッダー [warp_tile.h]
// Author : 吉田 悠人
//
//=============================================================================

//二重インクルード防止
#ifndef _WARP_TILE_H_
#define _WARP_TILE_H_

//*****************************
// インクルード
//*****************************
#include "tile.h"
#include "map.h"

//*****************************
//前方宣言
//*****************************
class CModel;

//*****************************
//マクロ定義
//*****************************

//*****************************
// クラス定義
//*****************************
class CWarpTile : public CTile
{
public:
	//*****************************
	// 列挙
	//*****************************
	// ステート
	typedef enum
	{
		WARP_TILE_NORMAL = 0,	//通常状態
		WARP_TILE_WARP,			//ワープ状態
		WARP_TILE_STOP			//停止状態
	}WARP_TILE_STATE;


	//*****************************
	//メンバ関数
	//*****************************
	CWarpTile();
	~CWarpTile();

	HRESULT Init(void);
	void Update(void);
	
	//*****************************
	//変数の取得設定
	//*****************************

private:
	void HitPlayerAction(CPlayer*pPlayer);	// プレイヤーが乗っているか
	
	//*****************************
	// メンバ変数
	//*****************************
	bool			m_bStep;		// 載っているフラグ
	D3DXVECTOR3		m_Move;			// 移動量
	int				m_nMoveCount;	// 移動カウント
	bool			m_bReversal;	// 反転フラグ(trueなら-)
};

#endif